// Задача №35
// Задайте одномерный массив из 123 случайных
// чисел. Найдите количество элементов массива,
// значения которых лежат в отрезке [10,99].
// Например:
// Пример для массива из 5, а не 123 элементов. В
// своем решении сделайте для 123
// [5, 18, 123, 6, 2] -> 1
// [1, 2, 3, 6, 2] -> 0
// [10, 11, 12, 13, 14] -> 5


int[] Gen1DArr(int len, int but, int top)
{
  if(but > top)
  {
    int buf = but;
    but = top;
    top = buf;
  }
  Random rnd = new Random();
  int[] arr = new int[len];
  for(int i = 0; i < arr.Length; i++)
  {
    arr[i] = rnd.Next(but, top + 1); 
  }
  return arr;
}

// Метод печати массива
void Print1DArr(int[] arr)
{
  Console.Write("[");
  for(int i = 0; i < arr.Length - 1; i++)
  {
    Console.Write(arr[i] + ", ");
  }
  Console.WriteLine(arr[arr.Length - 1] + "]");
}

int ElmInRange(int[]arr, int min, int max)
{
  int res = 0;
  for(int i = 0; i < arr.Length; i++)
  {
    if (arr[i] >= min && arr[i] <= max)
    {
      res++;
    } 
  }
  return res;
}

int[] arr = Gen1DArr(123, 0, 1000);
Print1DArr(arr);
int res = ElmInRange(arr, 10, 99);
Console.WriteLine("Элеиентов, лежащих в границах [10;99]: "+ res);
